In [3]:
import pandas as pd
import numpy as np

df_customer = pd.read_csv('data/customer.csv')
df_sales = pd.read_csv('data/sales.csv')
df_product = pd.read_csv('data/products.csv')
df_prod_supplier=pd.read_csv('data/prod_suppliers.csv')
df_supplier=pd.read_csv('data/suppliers.csv')
df_prod_supplier2=pd.read_csv('data/prod_suppliers2.csv')
df_product1=pd.read_csv('data/products.csv')
df_product2=pd.read_csv('data/products2.csv')
df_product3=pd.read_csv('data/products3.csv')

## Merge and joins
Four dataframes are given: customer, sales, products and prod_supplier. Investigate the dataframes.

In [48]:
df_customer.head()

   c_id Customer
0     1     Rabi
1     2     Raju
2     3     Alex
3     4     Rani
4     5     King

In [49]:
df_sales.head()

   sale_id  c_id  p_id  product  qty store
0        1     2     3  Monitor    2   ABC
1        2     2     4      CPU    1   DEF
2        3     1     3  Monitor    3   ABC
3        4     4     2      RAM    2   DEF
4        5     2     3  Monitor    3   ABC

In [50]:
df_product

   p_id       product  price
0     1     Hard Disk     80
1     2           RAM     90
2     3       Monitor     75
3     4           CPU     55
4     5      Keyboard     20
5     6         Mouse     10
6     7   Motherboard     50
7     8  Power supply     20

In [52]:
df_prod_supplier

   p_id  supp_id      suppliername
0     1        1  Hypertek Systems
1     2        1  Hypertek Systems
2     3        2   informatique.nl
3     8        1  Hypertek Systems
4     4        3    centurytech.sg
5     5        3    centurytech.sg
6     6        2   informatique.nl
7     7        3    centurytech.sg

### One -to-one joins

2. Construct a new dataframe df_product_extended which adds the columns supp_id and suppliername from df_prod_supplier to df_products.Verify if the operation is ok.

In [53]:
df_product_extended=pd.merge(df_product,df_prod_supplier)

In [54]:
df_product_extended

   p_id       product  price  supp_id      suppliername
0     1     Hard Disk     80        1  Hypertek Systems
1     2           RAM     90        1  Hypertek Systems
2     3       Monitor     75        2   informatique.nl
3     4           CPU     55        3    centurytech.sg
4     5      Keyboard     20        3    centurytech.sg
5     6         Mouse     10        2   informatique.nl
6     7   Motherboard     50        3    centurytech.sg
7     8  Power supply     20        1  Hypertek Systems

3. What did you notice about the merge?

A. It "knows" that p_id is the join key (in SQL we needed to specify the join key)
B. The rows do not need to appear in the same order (e.g. Power supply p_id 8 was in row 4 for the prod_supplier table) )

### Many-to-one joins (similar to SQL INNER JOIN)

 How can we create a table with the prod_supplier information and also the emails, phone numbers and address of the suppliers? Identify the new dataframe as df_prod_extended_supplier

In [56]:
df_prod_extended_supplier=pd.merge(df_prod_supplier,df_supplier)

In [57]:
df_prod_extended_supplier

,p_id,supp_id,suppliername,email,phone,address
0,1,1,Hypertek Systems,sales@hypertek.be,3256894514,Groenplaats 4 Antwerpen
1,2,1,Hypertek Systems,sales@hypertek.be,3256894514,Groenplaats 4 Antwerpen
2,3,2,informatique.nl,info@informatique.nl,312335679,Willem2plein 3 Rotterdam
3,8,1,Hypertek Systems,sales@hypertek.be,3256894514,Groenplaats 4 Antwerpen
4,4,3,centurytech.sg,info@centurytech.sg,657754637,China Tower 3 Singapore
5,5,3,centurytech.sg,info@centurytech.sg,657754637,China Tower 3 Singapore
6,6,2,informatique.nl,info@informatique.nl,312335679,Willem2plein 3 Rotterdam
7,7,3,centurytech.sg,info@centurytech.sg,657754637,China Tower 3 Singapore

5. What happens when in one of the files you have supplier_name instead of suppliername?

We see the column suppliername and the column supplier_name!

### Many-to-many joins (compare it with cartesian join or cross join in SQL)

Consider a dataframe which for every major contains a list of courses.

In [10]:
df_courses = pd.DataFrame({
    'major': ['AI', 'AI','AI','Infrastructure & System Engineering','Infrastructure & System Engineering', 'Infrastructure & System Engineering','Application Development','Application Development','Application Development','Application Development','Application Development','Application Development'],
    'courses': [
        'Machine Learning', 'Deep Learning', 'Natural Language Processing',
        'Network Security', 'Cloud Computing', 'Database Management',
        'Software Engineering', 'Systems Design', 'Embedded Systems',
        'Web Development', 'Mobile App Development', 'Software Testing'
    ]
})

In [11]:
df_courses

                                  major                      courses
0                                    AI             Machine Learning
1                                    AI                Deep Learning
2                                    AI  Natural Language Processing
3   Infrastructure & System Engineering             Network Security
4   Infrastructure & System Engineering              Cloud Computing
5   Infrastructure & System Engineering          Database Management
6               Application Development         Software Engineering
7               Application Development               Systems Design
8               Application Development             Embedded Systems
9               Application Development              Web Development
10              Application Development       Mobile App Development
11              Application Development             Software Testing

Next we consider students who participate in one of the majors.

In [12]:
df_students= pd.DataFrame({
    'student_name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'major': ['AI', 'Infrastructure & System Engineering', 'Infrastructure & System Engineering', 'Application Development', 'AI', 'Application Development']
})


# Display the DataFrame
print(df_students)

  student_name                                major
0        Alice                                   AI
1          Bob  Infrastructure & System Engineering
2      Charlie  Infrastructure & System Engineering
3        David              Application Development
4          Eva                                   AI
5        Frank              Application Development

8. Construct a list of all the courses a student needs to follow.

In [13]:
df_listcourses=pd.merge(df_students,df_courses)

In [169]:
df_listcourses

,student_name,major,courses
0,Alice,AI,Machine Learning
1,Alice,AI,Deep Learning
2,Alice,AI,Natural Language Processing
3,Bob,Infrastructure & System Engineering,Network Security
4,Bob,Infrastructure & System Engineering,Cloud Computing
5,Bob,Infrastructure & System Engineering,Database Management
6,Charlie,Infrastructure & System Engineering,Network Security
7,Charlie,Infrastructure & System Engineering,Cloud Computing
8,Charlie,Infrastructure & System Engineering,Database Management
9,David,Application Development,Software Engineering
10,David,Application Development,Systems Design
11,David,Application Development,Embedded Systems
12,David,Application Development,Web Development
13,David,Application Development,Mobile App Development
14,David,Application Development,Software Testing
15,Eva,AI,Machine Learning
16,Eva,AI,Deep Learning
17,Eva,AI,Natural Language Processing
18,Frank,Application Development,Software Engineering
19,Frank,Application Development,Systems Design
20,Frank,Application Development,Embedded Systems
21,Frank,Application Development,Web Development
22,Frank,Application Development,Mobile App Development
23,Frank,Application Development,Software Testing

### Merge keys

In SQL we have the option to specify the join-key, in Pandas we can do the same and avoid problems that columns have different labels but the same content.

9. Read the file prod_suppliers2.csv next in Suppliers.csv we still have suppliersname but in prod_suppliers we call this column supplier (also supp_id is omitted). How do you join the two tables without changing the columns names and in the end you keep suppliername in the table?

In [76]:
df=pd.merge(df_prod_supplier2,df_supplier, left_on='supplier',right_on="suppliername").drop('supplier',axis=1)

In [77]:
df.head()

,p_id,supp_id,suppliername,email,phone,address
0,1,1,Hypertek Systems,sales@hypertek.be,3256894514,Groenplaats 4 Antwerpen
1,2,1,Hypertek Systems,sales@hypertek.be,3256894514,Groenplaats 4 Antwerpen
2,3,2,informatique.nl,info@informatique.nl,312335679,Willem2plein 3 Rotterdam
3,8,1,Hypertek Systems,sales@hypertek.be,3256894514,Groenplaats 4 Antwerpen
4,4,3,centurytech.sg,info@centurytech.sg,657754637,China Tower 3 Singapore

10. a. Take df_product and df_prod_supplier2 transform the p_id in an index
    b. Merge the two tables on the index
    c. Do the same but use the join method of Pandas
    d. Verify that both are the same

In [78]:
df_product=df_product.set_index('p_id')
df_prod_supplier2=df_prod_supplier2.set_index('p_id')

In [79]:
df=pd.merge(df_product,df_prod_supplier2,left_index=True,right_index=True)
print(df)

           product  price          supplier
p_id
1        Hard Disk     80  Hypertek Systems
2              RAM     90  Hypertek Systems
3          Monitor     75   informatique.nl
4              CPU     55    centurytech.sg
5         Keyboard     20    centurytech.sg
6            Mouse     10   informatique.nl
7      Motherboard     50    centurytech.sg
8     Power supply     20  Hypertek Systems

In [80]:
dfj=df_product.join(df_prod_supplier2)
print(dfj)

           product  price          supplier
p_id
1        Hard Disk     80  Hypertek Systems
2              RAM     90  Hypertek Systems
3          Monitor     75   informatique.nl
4              CPU     55    centurytech.sg
5         Keyboard     20    centurytech.sg
6            Mouse     10   informatique.nl
7      Motherboard     50    centurytech.sg
8     Power supply     20  Hypertek Systems

11. a.Merge the sales, prod_suppliers and products into one dataframe. What wil you merge first
    b.How do you avoid having double columns?

In [89]:
df_temp=pd.merge(df_sales,df_product,left_on=['p_id','product'],right_on=['p_id','product'])

In [90]:
print(df_temp)

   sale_id  c_id  p_id  product  qty store  price
0        1     2     3  Monitor    2   ABC     75
1        2     2     4      CPU    1   DEF     55
2        3     1     3  Monitor    3   ABC     75
3        4     4     2      RAM    2   DEF     90
4        5     2     3  Monitor    3   ABC     75
5        6     3     3  Monitor    2   DEF     75
6        7     2     2      RAM    3   ABC     90
7        8     3     2      RAM    2   DEF     90
8        9     2     3  Monitor    2   ABC     75

In [92]:
df_final=pd.merge(df_temp,df_prod_supplier,left_on='p_id',right_on='p_id')

In [93]:
df_final

   sale_id  c_id  p_id  product  qty store  price  supp_id      suppliername
0        1     2     3  Monitor    2   ABC     75        2   informatique.nl
1        2     2     4      CPU    1   DEF     55        3    centurytech.sg
2        3     1     3  Monitor    3   ABC     75        2   informatique.nl
3        4     4     2      RAM    2   DEF     90        1  Hypertek Systems
4        5     2     3  Monitor    3   ABC     75        2   informatique.nl
5        6     3     3  Monitor    2   DEF     75        2   informatique.nl
6        7     2     2      RAM    3   ABC     90        1  Hypertek Systems
7        8     3     2      RAM    2   DEF     90        1  Hypertek Systems
8        9     2     3  Monitor    2   ABC     75        2   informatique.nl

### What about left, right and outer joins?

In SQL we have the notion of a left and right join and an outer join. What are the pandas counterparts?
Let's review our student example

In [170]:
print(df_students)

  student_name                                major
0        Alice                                   AI
1          Bob  Infrastructure & System Engineering
2      Charlie  Infrastructure & System Engineering
3        David              Application Development
4          Eva                                   AI
5        Frank              Application Development

12. Suppose that our students also have the option to have a minor:
a. Make a Dataframe with a column student_name and a column minor
Alice takes the minor French communication and Frank chooses LLM. Ali finished the major but still wants to add a minor in Cybersecurity on his CV label this Dataframe as df_minor
b. Merge the df_students with df_minor. What happens?
c. Do we have duplicate columns? How do we drop them?
d Construct a dataframe with all the information of all the students
e. Construct a dataframe with all the information of the majors and optional that of the minors
f. Construct a dataframe with all the info about the minors and optional that of the majors

In [171]:
data={'Student_name':['Alice','Frank','Ali'],'Minor':['French communication','LLM','Cybersecurity']}
df_minor=pd.DataFrame(data)

In [172]:
df_minor

  Student_name                 Minor
0        Alice  French communication
1        Frank                   LLM
2          Ali         Cybersecurity

In [176]:
#b
df=pd.merge(df_students,df_minor,left_on='student_name',right_on='Student_name')
#c
df=df.drop('Student_name',axis=1)

In [177]:
df

  student_name                    major                 Minor
0        Alice                       AI  French communication
1        Frank  Application Development                   LLM

b. We see only the information for Alice and Frank because they are the only ones with a minor and a major

In [105]:
#d
df_outer=pd.merge(df_students,df_minor,left_on='student_name',right_on='Student_name',how='outer')

In [106]:
df_outer

,student_name,major,Student_name,Minor
0,NaN,NaN,Ali,Cybersecurity
1,Alice,AI,Alice,French communication
2,Bob,Infrastructure & System Engineering,NaN,NaN
3,Charlie,Infrastructure & System Engineering,NaN,NaN
4,David,Application Development,NaN,NaN
5,Eva,AI,NaN,NaN
6,Frank,Application Development,Frank,LLM

In [107]:
#e
df_left=pd.merge(df_students,df_minor,left_on='student_name',right_on='Student_name',how='left')

In [108]:
df_left

,student_name,major,Student_name,Minor
0,Alice,AI,Alice,French communication
1,Bob,Infrastructure & System Engineering,NaN,NaN
2,Charlie,Infrastructure & System Engineering,NaN,NaN
3,David,Application Development,NaN,NaN
4,Eva,AI,NaN,NaN
5,Frank,Application Development,Frank,LLM

In [109]:
#f
df_right=pd.merge(df_students,df_minor,left_on='student_name',right_on='Student_name',how='right')
df_right

  student_name                    major Student_name                 Minor
0        Alice                       AI        Alice  French communication
1        Frank  Application Development        Frank                   LLM
2          NaN                      NaN          Ali         Cybersecurity